{
	"events": [
		{
			"id": "countenance_a_memory",
			"name": "Countenance A Memory",
			"description": "As you navigate the dim halls of the Abbey, a recollection begins to sneak up on you. At first it's just a faint touch, but as time passes you feel it approaching the distinct, nudging out of the periphery. Will you face the memory, or excise that part of yourself?",
			"requirements": {},
			"outcomes": [
				{
					"button_text": "Face the memory.",
					"outcome_title": "For better or for worse.",
					"outcome_description": "Acknowledged, and surpassed. You hope it will not recur again.",
					"effects":  [
						{
						"type": "triggerScenario",
						"string_data": "CountenanceAMemory",
						"int_data": -1
						}
					]
				},
				{
					"button_text": "Excise and continue.",
					"outcome_title": "It's done.",
					"outcome_description": "A moment of pain, and the future lies ahead. \n \nTake one damage.",
					"effects": [
						{
						"type": "changeValue",
						"string_data": "health",
						"int_data": 1
						}
					]
				}
			]
		},
		{
			"id": "remnants_of_a_battle",
			"name": "Remnants of a Battle",
			"description": "You step into a courtyard. It is quiet and peaceful. The sun beams down from overhead, but it's unusually chilly for the time of year. You are reminded of a museum you visited a couple years ago where you spent the day alone, walking from exhibit to exhibit, your thoughts falling aimlessly from one subject to the next. You used to do things like that more, you think. You don't do things like that much anymore.  \n \nA few bodies lie around the courtyard, clearly the leftovers of a skirmish some months past. It is not clear to you if there were any survivors.  \n \nThe closest body has a fat-looking pouch upon his belt. You are drawn to it. Do you reach for it now, or spend a little while?",
			"requirements": {},
			"outcomes": [
				{
					"button_text": "Reach for it now.",
					"outcome_title": "Another Man's Treasure",
					"outcome_description": "The man's sack was filled with gold. You are a richer man than you were. He is not a poorer man than he was. \n \nReceive 5 gold.",
					"effects": [
						{
						"type": "changeValue",
						"string_data": "gold",
						"int_data": 5
						}
					]
				},
				{
					"button_text": "Reach for it later.",
					"outcome_title": "A Ladybug Crawls Across Your Hand.",
					"outcome_description": "You sit on a nearby bench a while, enjoying the open air. You are not in any particular hurry. You are not losing any time. When you are ready to go, you will leave, and you will leave this place behind.",
					"effects": [
						{
						"type": "offerCard",
						"string_data": "PatientBlow",
						"int_data": 0
						}
					]
				}
			]
		},
		{
			"id": "an_unhappy_event",
			"name": "An Unhappy Event",
			"description": "Coming around a corner, you see light falling out of an open doorway up ahead. You drop to your hands and knees and crawl to peer inside. It is an unremarkable room with no treasures. Beasts and unpleasant strangers are faffing about. There is nothing to compel interest or to motivate entry. It is a boring place filled with your enemies. \n \nTheir attention is consumed by their own pointless business. You could so easily slip by. In a lot of ways, that'd be the mature decision. (You've always believed people should be mature to one another.) And, yet, something holds you up. You've been wondering lately if you might, perhaps, be a big wimp. After all, you keep finding yourself in situations like these: On your hands and knees, on the ground, crawling like a little piggie, oinking and snuffling in the dirt, and so on. And just oinking right past this room might do a lot to confirm your suspicions. Do you risk it?",
			"requirements": {},
			"outcomes": [
				{
					"button_text": "Fight. I'm no coward.",
					"outcome_title": "Self-Image Restored",
					"outcome_description": "You're tired, and maybe a little roughed up, but at least you can rest confident knowing that you're not a baby.",
					"effects": [
						{
						"type": "triggerScenario",
						"string_data": "AnUnhappyEvent",
						"int_data": 0
						}
					]
				},
				{
					"button_text": "Pass by. I am perhaps a coward.",
					"outcome_title": "You're Gonna Wonder A While",
					"outcome_description": "You safely skirt past the door and scurry down the hall. Your body is intact. Can you say the same for your beliefs? \n \nYou will begin your next battle Poisoned.",
					"effects": [
						{
						"type": "applyModifier",
						"string_data": "Poison_1_3",
						"int_data": 0
						}
					]
				}
			]
		},
		{
			"id": "moment_of_self_reflection",
			"name": "Moment of Self-Reflection",
			"description": "You developed your system of thought over the course of years by scaffolding your own beliefs atop theories and concepts you'd heard from others. The collected knowledge of the world--of the people that had preceded you, immortalized in books, shared and altered in conversation--had seemed a vast and immutable expanse of bedrock. Solid and secure. And your own thinking, your life, had taken that bedrock as its foundation, and so partook in its solidity. You had felt yourself a member of a vast community of friends and confidants, all of whom were waiting for you in the next room over. \n \nThis surety had given you resolve to enter the Abbey, and had kept your confidence alight through the first dim days of your passage through this gloomy, dwindled place. But as time as passed, things have changed. That comforting bedrock feels very far away. Your beliefs have begun to feel less like a home and more like a houseboat, built upon nothing, subject to the bucking of the waves. Your canon has fled you. The shore recedes. How will you repair the leaky vessel of your thought?",
			"requirements": {},
			"outcomes": [
				{
					"button_text": "Grit my teeth and bear down.",
					"outcome_title": "You are your own servant and master.",
					"outcome_description": "There is no time for doubt. Let your mind deterioriate and your beliefs flee you. You will pay your dudes when the time comes. For now, there is work to be done.",
					"effects": [
						{
						"type": "offerCard",
						"string_data": "ForcibleReminder",
						"int_data": 0
						}
					]
				},
				{
					"button_text": "Lighten my load.",
					"outcome_title": "Bent, not broken.",
					"outcome_description": "You allow yourself a bit of reprieve. Your thoughts soften, but so does your resolve. One step at a time.",
					"effects": [
						{
						"type": "offerCard",
						"string_data": "Half-AssedSabbatical",
						"int_data": 0
						}
					]
				}
			]
		},
		{
			"id": "new_weird_friend",
			"name": "New Weird Friend",
			"description": "There are communities down here. You hadn't expected that. You feel silly, you should have known. There are open caverns lit with oil lanterns, unsteady rope bridges over nothing at all, warrens of bedrooms and mess halls carved out of the stone. Knotted ropes are strung between landmarks so travelers can find their way. You hold onto them for dear life, blinking against the dim with each tentative step forward. Children, born and raised in the Abbey, skip past you without hesitation. Sometimes you catch glimpses of their faces in the guttering light, their pupils wide and black, their emotions unguarded. \n \nYou come to one of these communities exhausted and underslept. A man hears your passage across the rope bridge and meets you at the end. He's whip-thin and hunched, with big teeth that catch light. He offers you a place to sleep, and you graciously accept. When you awake, he's there waiting for you with a knapsack full of food. He offers you a table and his company, but understands if you have to get going.",
			"requirements": {},
			"outcomes": [
				{
					"button_text": "Sit with the guy.",
					"outcome_title": "A Nice Meal",
					"outcome_description": "You and the guy talk for a while. He excitedly shares some local gossip with you, and acts politely interested when you talk about your life before the Abbey. Right before you leave, he tells you a somewhat involved joke. The punchline doesn't strike you as immediately funny, but there's something slanty and difficult about it. It sticks with you for a few days. You begin to suspect that there's something meaningful in that lack of understanding, in that gap between your thinking and the precise intent of the punchline. That if you could understand it totally, innately, as humor, as the joke's teller did, whatever obstacle lies between you and the people who live down here, in the Abbey, would cease to block your way.",
					"effects": [
						{
						"type": "offerCard",
						"string_data": "BizarreJoke",
						"int_data": 0
						}
					]
				},
				{
					"button_text": "Say goodbye to the guy.",
					"outcome_title": "Goodbye, Guy",
					"outcome_description": "You say goodbye to the guy and continue on your way. You don't open the food for a few hours, once you've put some miles between yourself and the village. The sack contains a loaf of sourdough bread, two types of hard cheese, a bushel of cave bananas, kiwis, salted butter, mole jerky, and a pewter butter knife, all thoughtfully packed to prevent any of the food being bruised or jostled as you move. You feel an immense gratitude toward this stranger and his kindness, and you hope you meet him again.",
					"effects": [
						{
						"type": "offerCard",
						"string_data": "RestivePause",
						"int_data": 0
						}
					]
				}
			]
		}
	]
}